app/controllers/locations_controller.rb

  def all
    locations = Location.all
---
SELECT "locations".* FROM "locations"